{-# OPTIONS_GHC -fno-warn-missing-signatures #-}
{-# LANGUAGE QuasiQuotes #-}

module Grammar.Greek.Morph.Smyth.Nouns.Nouns where

import Grammar.Greek.Morph.QuasiQuoters

-- Smyth 216. Feminines
firstDeclensionFeminines =
  [ [nounParadigm|
      χώρᾱ
      χώρᾱς
      χώρᾳ
      χώρᾱν
      χώρᾱ

      χώρᾱ
      χώραιν

      χῶραι
      χωρῶν
      χώραις
      χώρᾱς
    |]
  , [nounParadigm|
      νί̄κη
      νί̄κης
      νί̄κῃ
      νί̄κην
      νί̄κη

      νί̄κᾱ
      νί̄καιν

      νῖκαι
      νῑκῶν
      νί̄καις
      νί̄κᾱς
    |]
  , [nounParadigm|
      φυγή
      φυγῆς
      φυγῇ
      φυγήν
      φυγή

      φυγά̄
      φυγαῖν

      φυγαί
      φυγῶν
      φυγαῖς
      φυγά̄ς
    |]
  , [nounParadigm|
      πολί̄της
      πολί̄του
      πολί̄τῃ
      πολί̄την
      πολῖτα

      πολί̄τᾱ
      πολί̄ταιν

      πολῖται
      πολῑτῶν
      πολί̄ταις
      πολί̄τᾱς
    |]
  , [nounParadigm|
      κριτής	
      κριτοῦ	
      κριτῇ	
      κριτήν	
      κριτά	

      κριτά̄	
      κριταῖν	

      κριταί	
      κριτῶν	
      κριταῖς	
      κριτά̄ς	
    |]
  , [nounParadigm|
      Ἀτρείδης
      Ἀτρείδου
      Ἀτρείδῃ
      Ἀτρείδην
      Ἀτρείδη

      Ἀτρείδᾱ
      Ἀτρείδαιν

      Ἀτρεῖδαι
      Ἀτρειδῶν
      Ἀτρείδαις
      Ἀτρείδᾱς
    |]
  ]

  -- Smyth 227. Contracts
firstDeclensionContracts =
  [ 
-- [nounParadigm|
--    μνᾶ
--    μνᾶς
--    μνᾷ
--    μνᾶν
--     *

--    μνᾶ
--    μναῖν

--    μναῖ
--    μνῶν
--    μναῖς
--    μνᾶς
--  |]
-- ,[nounParadigm|
--    σῡκῆ
--    σῡκῆς
--    σῡκῇ
--    σῡκῆν
--      *

--    σῡκᾶ
--    σῡκαῖν

--    σῡκαῖ
--    σῡκῶν
--    σῡκαῖς
--    σῡκᾶς
--  |]
-- ,[nounParadigm|
--    Βορρᾶ-ς
--    Βορροῦ
--    Βορρᾷ
--    Βορρᾶν
--      *

--      *
--      *

--      *
--      *
--      *
--      *
--  |]
-- ,[nounParadigm|
--    Ἑρμῆ-ς
--    Ἑρμοῦ
--    Ἑρμῆ
--    Ἑρμῆ-ν
--     *

--    Ἑρμᾶ
--    Ἑρμαῖν

--    Ἑρμαῖ
--    Ἑρμῶν
--    Ἑρμαῖς
--    Ἑρμᾶς
--  |]
  ]
